package entity;

import lombok.Getter;
import lombok.RequiredArgsConstructor;

@Getter
@RequiredArgsConstructor
public enum Terminal {
    Буйнакск("Буйнакск",1),
    Владикавказ("Владикавказ",2),
    Грозный("Грозный",3),
    Дербент("Дербент",4),
    Екатеринбург("Екатеринбург",5),
    Избербаш("Избербаш",6),
    Каспийск("Каспийск",7),
    Краснодар("Краснодар",8),
    Маджалис("Маджалис",9),
    Махачкала("Махачкала",10),
    Москва("Москва",11),
    Набережные_Челны("Набережные Челны",13),
    Нальчик("Нальчик",14),
    Нефтеюганск("Нефтеюганск",15),
    Нижневартовск("Нижневартовск",16),
    Новосибирск("Новосибирск",17),
    Новый_Уренгой("Новый Уренгой",18),
    Ноябрьск("Ноябрьск",19),
    Нягань("Нягань",20),
    Омск("Омск",21),
    Пермь("Пермь",22),
    Пятигорск("Пятигорск",23),
    Ростов_на_Дону("Ростов-на-Дону",24),
    Санкт_Петербург("Санкт-Петербург",25),
    Симферополь("Симферополь",26),
    Ставрополь("Ставрополь", 27),
    Стрежевой("Стрежевой",28),
    Сургут("Сургут",29),
    Тобольск("Тобольск",30),
    Томск("Томск",31),
    Тюмень("Тюмень",32),
    Хасавюрт("Хасавюрт",33),
    Челябинск("Челябинск",34),
    Черкесск("Черкесск",35);


    private final String path;
    private final Integer id;
}
